# Assuntos
### DADOS AUSENTES
### GROUP BY
### DATASET

In [1]:
import pandas as pd
import numpy as np

In [13]:
df = pd.DataFrame(
    {
        'A': [1, 2, np.nan],
        'B': [5, np.nan, np.nan],
        'C': [1, 2, 3],
        'D': [20, 0, 'no data']
    }
)

In [4]:
print(df, '\n')

     A    B  C        D
0  1.0  5.0  1       20
1  2.0  NaN  2        0
2  NaN  NaN  3  no data

In [8]:
print(df.dropna(axis = 1)) #remove as colunas que tem dados nan. nao eh boa pratica

   C        D
0  1       20
1  2        0
2  3  no data

In [10]:
print(df['A'].isnull()) #pergunta pro dataset onde ha vazios

0    False
1    False
2     True
Name: A, dtype: bool

In [11]:
df['B'].isnull().value_counts() #pergunta se ha vazio e retorna a quantidade de vazios e preenchidos.

B
True     2
False    1
Name: count, dtype: int64

In [12]:
df['A'].fillna(value = df['A'].mean()) #completa os vazios da coluna A com a media de A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [14]:
df['A'].ffill() #Coloca os valores NaN com o ultimo que vem antes. No caso, era 1, 2, nan. O dois passou pro NaN.

0    1.0
1    2.0
2    2.0
Name: A, dtype: float64

In [15]:
from datetime import datetime, timedelta

In [17]:
time = pd.to_datetime('2020-05-10')

In [18]:
time.date()

datetime.date(2020, 5, 10)

In [20]:
time.year

2020

In [21]:
time.day

10

In [30]:
time + timedelta(days = 5) #soma 5 dias na data armazenada

Timestamp('2020-05-15 00:00:00')

#### GroupBy

In [36]:
data = {
    'Empresa': ['CASAS_BAHIA', 'CASAS_BAHIA', 'MAGAZINE_L', 'MAGAZINE_L', 'SHOPEE', 'SHOPEE'],
    'Nome': ['Samuel', 'Dennis', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
    'Venda': [200, 120, 340, 124, 243, 350]
}
df = pd.DataFrame(data)

In [37]:
df

       Empresa      Nome  Venda
0  CASAS_BAHIA    Samuel    200
1  CASAS_BAHIA    Dennis    120
2   MAGAZINE_L   Roberta    340
3   MAGAZINE_L  Patrícia    124
4       SHOPEE     Bruno    243
5       SHOPEE      Vera    350

In [45]:
por_empresa = df.groupby('Empresa')

In [46]:
por_empresa.mean(numeric_only = True) #media

             Venda
Empresa
CASAS_BAHIA  160.0
MAGAZINE_L   232.0
SHOPEE       296.5

In [47]:
por_empresa.std(numeric_only = True) #desvio padrao

                  Venda
Empresa
CASAS_BAHIA   56.568542
MAGAZINE_L   152.735065
SHOPEE        75.660426

In [48]:
por_empresa.min(numeric_only = True) #valor min de cada empresa

             Venda
Empresa
CASAS_BAHIA    120
MAGAZINE_L     124
SHOPEE         243

In [50]:
por_empresa.max(numeric_only = True) #valor max de cada empresa

             Venda
Empresa
CASAS_BAHIA    200
MAGAZINE_L     340
SHOPEE         350

In [52]:
por_empresa.count() #contagem de instancias de cada empresa

             Nome  Venda
Empresa
CASAS_BAHIA     2      2
MAGAZINE_L      2      2
SHOPEE          2      2

In [53]:
por_empresa.describe()

            Venda
            count   mean         std    min     25%    50%     75%    max
Empresa
CASAS_BAHIA   2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MAGAZINE_L    2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
SHOPEE        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [54]:
por_empresa.describe().transpose() #transposta

Empresa      CASAS_BAHIA  MAGAZINE_L      SHOPEE
Venda count     2.000000    2.000000    2.000000
      mean    160.000000  232.000000  296.500000
      std      56.568542  152.735065   75.660426
      min     120.000000  124.000000  243.000000
      25%     140.000000  178.000000  269.750000
      50%     160.000000  232.000000  296.500000
      75%     180.000000  286.000000  323.250000
      max     200.000000  340.000000  350.000000

In [55]:
por_empresa.describe().transpose()['casas_bahia'.upper()] #informacoes estatisticas da casas bahia

Venda  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: CASAS_BAHIA, dtype: float64

In [57]:
frames = {
    'Classe': "Jr Jr Pl Pl Sr Sr".split(),
    'Nome': 'Brunnete Julia Camila Freddie Nikolas Salomao'.split(),
    'Venda': [200, 120, 340, 124, 243, 3560]
}

#### Exercícios
- 1) Com frames, gere o dataframe.
- 2) Filtre "Vendas", valores maiores que 300
- 3) Me retorne as informações somadas das vendas com base no cargo
- 4) Gere um DF2, com as informações de vendas modificadas
- 5) Concatene os datasets
- 6) Retorne o Dataframe com a soma de vendas por cargo ,por nome

In [63]:
#questao 01
df_frames = pd.DataFrame(frames)
print(df_frames)

  Classe      Nome  Venda
0     Jr  Brunnete    200
1     Jr     Julia    120
2     Pl    Camila    340
3     Pl   Freddie    124
4     Sr   Nikolas    243
5     Sr   Salomao   3560

In [61]:
#questao 02
df_maior300 = df_frames[df_frames['Venda'] > 300]
print(df_maior300)

  Classe     Nome  Venda
2     Pl   Camila    340
5     Sr  Salomao   3560

In [69]:
#questao 03
df_cargo = df_frames.groupby('Classe')
df_cargo.sum()

                  Nome  Venda
Classe
Jr       BrunneteJulia    320
Pl       CamilaFreddie    464
Sr      NikolasSalomao   3803

In [72]:
#questao 04
frames2 = {
    'Classe': "Jr Jr Pl Pl Sr Sr".split(),
    'Nome': 'Brunnete Julia Camila Freddie Nikolas Salomao'.split(),
    'Venda': [500, 20, 740, 324, 203, 6560]
}
df2 = pd.DataFrame(frames2)
df2

  Classe      Nome  Venda
0     Jr  Brunnete    500
1     Jr     Julia     20
2     Pl    Camila    740
3     Pl   Freddie    324
4     Sr   Nikolas    203
5     Sr   Salomao   6560

In [81]:
#questao 05
df_concatenado = pd.concat([df_frames, df2])
df_concatenado

  Classe      Nome  Venda
0     Jr  Brunnete    200
1     Jr     Julia    120
2     Pl    Camila    340
3     Pl   Freddie    124
4     Sr   Nikolas    243
5     Sr   Salomao   3560
0     Jr  Brunnete    500
1     Jr     Julia     20
2     Pl    Camila    740
3     Pl   Freddie    324
4     Sr   Nikolas    203
5     Sr   Salomao   6560

In [80]:
#questao 06
df_nome = df_frames.groupby(['Nome' ,'Classe'])
df_nome.sum().reset_index()

       Nome Classe  Venda
0  Brunnete     Jr    200
1    Camila     Pl    340
2   Freddie     Pl    124
3     Julia     Jr    120
4   Nikolas     Sr    243
5   Salomao     Sr   3560